<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>HasRemovalPasscode</key>
	<false/>
	<key>PayloadContent</key>
	<array>
{% if imap.host || pop.host %}
		<dict>
			<key>EmailAccountDescription</key>
			<string>{{email}}</string>
			<key>EmailAccountName</key>
			<string>{{email}}</string>
			<key>EmailAccountType</key>
			<string>{% if imap.host %}EmailTypeIMAP{% else %}EmailTypePOP{% endif %}</string>
			<key>EmailAddress</key>
			<string>{{email}}</string>
			<key>IncomingMailServerAuthentication</key>
			<string>EmailAuthPassword</string>
			<key>IncomingMailServerHostName</key>
			<string>{% if imap.host %}{{imap.host}}{% else %}{{pop.host}}{% endif %}</string>
			<key>IncomingMailServerPortNumber</key>
			<integer>{% if imap.host %}{{imap.port}}{% else %}{{pop.port}}{% endif %}</integer>
			<key>IncomingMailServerUseSSL</key>
			<{%- if imap.host %}{{imapssl}}{% else %}{{popssl}}{% endif -%}/>
			<key>IncomingMailServerUsername</key>
			<string>{{email}}</string>
			<key>OutgoingPasswordSameAsIncomingPassword</key>
			<true/>
			<key>OutgoingMailServerAuthentication</key>
			<string>EmailAuthPassword</string>
			<key>OutgoingMailServerHostName</key>
			<string>{{smtp.host}}</string>
			<key>OutgoingMailServerPortNumber</key>
			<integer>{{smtp.port}}</integer>
			<key>OutgoingMailServerUseSSL</key>
			<{{smtpssl}}/>
			<key>OutgoingMailServerUsername</key>
			<string>{{email}}</string>
			<key>SMIMEEnabled</key>
			<false/>
			<key>SMIMEEnablePerMessageSwitch</key>
			<false/>
			<key>SMIMEEnableEncryptionPerMessageSwitch</key>
			<false/>
			<key>disableMailRecentsSyncing</key>
			<false/>
			<key>PayloadDescription</key>
			<string>{{info.name}} Email</string>
			<key>PayloadDisplayName</key>
			<string>{{email}}</string>
			<key>PayloadIdentifier</key>
			<string>{{mobile.identifier}}.com.apple.mail.managed.{{mobile.mail.uuid}}</string>
			<key>PayloadType</key>
			<string>com.apple.mail.managed</string>
			<key>PayloadUUID</key>
			<string>{{mobile.mail.uuid}}</string>
			<key>PayloadVersion</key>
			<real>1</real>
		</dict>
{% endif %}
{% if ldap.host %}
		<dict>
			<key>LDAPAccountDescription</key>
			<string>{{info.name}} LDAP</string>
			<key>LDAPAccountHostName</key>
			<string>{{ldap.host}}</string>
			<key>LDAPAccountUseSSL</key>
			<{{ldapssl}}/>
			<key>LDAPAccountUserName</key>
			<string>{{ldap.userfield}}={{username}},{{ldap.usersbase}}</string>
			<key>LDAPSearchSettings</key>
			<array>
				<dict>
					<key>LDAPSearchSettingDescription</key>
					<string>{{info.name}} Contacts</string>
					<key>LDAPSearchSettingSearchBase</key>
					<string>{{ldap.base}}</string>
					<key>LDAPSearchSettingScope</key>
					<string>LDAPSearchSettingScopeSubtree</string>
				</dict>
			</array>
			<key>PayloadDescription</key>
			<string>{{info.name}} LDAP</string>
			<key>PayloadDisplayName</key>
			<string>{{info.name}} Contacts</string>
			<key>PayloadIdentifier</key>
			<string>{{mobile.identifier}}.com.apple.ldap.account.{{mobile.ldap.uuid}}</string>
			<key>PayloadType</key>
			<string>com.apple.ldap.account</string>
			<key>PayloadUUID</key>
			<string>{{mobile.ldap.uuid}}</string>
			<key>PayloadVersion</key>
			<real>1</real>
		</dict>
{% endif %}
{% if caldav.host and caldav_enabled %}
		<dict>
			<key>CalDAVAccountDescription</key>
			<string>{{email}}</string>
			<key>CalDAVHostName</key>
			<string>{{caldav.host}}</string>
			<key>CalDAVPort</key>
			<integer>{{caldav.port}}</integer>
			<key>CalDAVUseSSL</key>
			{% if caldavssl %}<true/>{% else %}<false/>{% endif %}
			<key>CalDAVUsername</key>
			<string>{{email}}</string>
			<key>PayloadIdentifier</key>
			<string>{{mobile.identifier}}.com.apple.caldav.account.{{mobile.caldav.uuid}}</string>
			<key>PayloadType</key>
			<string>com.apple.caldav.account</string>
			<key>PayloadUUID</key>
			<string>{{mobile.caldav.uuid}}</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
{% endif %}
	</array>
	<key>PayloadDescription</key>
	<string>{{info.name}}</string>
	<key>PayloadDisplayName</key>
	<string>{{info.name}}</string>
	<key>PayloadIdentifier</key>
	<string>{{mobile.identifier}}</string>
	<key>PayloadOrganization</key>
	<string>{{domain}}</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>{{mobile.uuid}}</string>
	<key>PayloadVersion</key>
	<integer>2</integer>
</dict>
</plist>
